Docs/Reference/Content/images/dependencies/net10.0/mmd/alloverit-logging.mmd
flowchart LR
  alloverit-logging["AllOverIt.Logging"]
  microsoft-extensions-logging-abstractions_10-0-9["Microsoft.Extensions.Logging.Abstractions<br>v10.0.9"]
  microsoft-extensions-dependencyinjection-abstractions_10-0-9["Microsoft.Extensions.DependencyInjection.Abstractions<br>v10.0.9"]
  alloverit["AllOverIt"]
  alloverit-assertion["AllOverIt.Assertion"]
  alloverit-logging --> microsoft-extensions-logging-abstractions_10-0-9
  microsoft-extensions-logging-abstractions_10-0-9 --> microsoft-extensions-dependencyinjection-abstractions_10-0-9
  alloverit-logging --> alloverit
  alloverit --> alloverit-assertion
  style microsoft-extensions-logging-abstractions_10-0-9 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-dependencyinjection-abstractions_10-0-9 fill:#FFEC96,opacity:0.8
